/*14. Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.
*/ 

int x1 = 7*23;
Console.WriteLine("Введите число, которое хотите проверить");
int x2 = int.Parse(Console.WriteLine());

